
create_clock -name my_clk -period 20 [get_ports PCLK]
set_clock_uncertainty 0.5 [get_clocks my_clk]
set_clock_transition 0.1 [get_clocks my_clk]


set_input_delay -max 4 -clock my_clk [remove_from_collection [all_inputs] [get_ports PCLK]]


set_output_delay -max 4 -clock my_clk [all_outputs]

set_max_area 0

set_load 0.1 [all_outputs]
